fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/ВКМ_ВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатыЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда   
    
#Область ОбработчикиСобытий
  
Процедура ОбработкаПроведения(Отказ, Режим)     
    
    Если НЕ ЗначениеЗаполнено(Выплаты) Тогда
    
    	 ОбщегоНазначения.СообщитьПользователю("Не заполнено ни одной строчки"); 
         Отказ = Истина; 
         
    КонецЕсли;
    
    
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
        Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
        Движение.Сумма = ТекСтрокаВыплаты.Сумма;
    КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Процедура Автозаполнение() Экспорт
 
 	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
        |ИЗ
        |   РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
    
    РезультатЗапроса = Запрос.Выполнить();    
    
    Если РезультатЗапроса.Пустой() Тогда
    
    	 ОбщегоНазначения.СообщитьПользователю("Всё выплачено!"); 
         Возврат; 
    КонецЕсли;
    
    Выборка = РезультатЗапроса.Выбрать(); 
    
     Пока Выборка.Следующий() Цикл
        
        Строка = Выплаты.Добавить();        
		Строка.Сотрудник = Выборка.Сотрудник; 
        Строка.Подразделение = Выборка.Подразделение; 
        Строка.Сумма = Выборка.СуммаОстаток; 
        
    КонецЦикла;
 
КонецПроцедуры   

#КонецОбласти

#КонецЕсли
